src/DataProcessors/ЗаполнениеПараметровПодключения/ЗаполнениеПараметровПодключения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеПараметровПодключения</name>
</mdclass:DataProcessor>

src/Catalogs/ИнформационныеБазыПорта/ИнформационныеБазыПорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазыПорта</name>
  <predefined>
    <items>
      <name>EDS</name>
      <description>EDS</description>
    </items>
    <items>
      <name>УПП</name>
      <description>УПП</description>
    </items>
    <items>
      <name>УКТ</name>
      <description>УКТ</description>
    </items>
    <items>
      <name>ВМКТ</name>
      <description>ВМКТ</description>
    </items>
    <items>
      <name>Скаут</name>
      <description>Скаут</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресWSDL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочкиПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Путь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутЗапроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутЗапросаКарточки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URIПространстваИмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ЗаполнениеПараметровПодключения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Готовит таблицу предпросмотра переноса параметров из констант и значений по умолчанию.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Заполнять, База, Реквизит, ТекущееЗначение, НовоеЗначение, Источник.
Функция ПодготовитьЗаполнение() Экспорт

	Таблица = НоваяТаблицаПредпросмотра();
	ТекущиеЗначения = ТекущиеЗначенияСправочника();

	Для Каждого СтрокаИсточника Из ОписаниеЗаполнения() Цикл
		ТекущееЗначение = ТекущиеЗначения.Получить(КлючЗначения(СтрокаИсточника.База, СтрокаИсточника.Реквизит));
		СтрокаТаблицы = Таблица.Добавить();
		СтрокаТаблицы.База = СтрокаИсточника.База;
		СтрокаТаблицы.Реквизит = СтрокаИсточника.Реквизит;
		СтрокаТаблицы.Источник = СтрокаИсточника.Источник;
		СтрокаТаблицы.ТекущееЗначение = ПредставлениеЗначения(СтрокаИсточника.Реквизит, ТекущееЗначение);
		СтрокаТаблицы.НовоеЗначение = ПредставлениеЗначения(СтрокаИсточника.Реквизит, СтрокаИсточника.НовоеЗначение);
		СтрокаТаблицы.Заполнять = Не ЗначенияСовпадают(
			СтрокаИсточника.Реквизит,
			ТекущееЗначение,
			СтрокаИсточника.НовоеЗначение);
	КонецЦикла;

	Возврат Таблица;

КонецФункции

// Записывает отмеченные реквизиты предопределённых элементов справочника.
// Значения паролей читаются заново из констант, а не из формы.
//
// Параметры:
//  ОтмеченныеСтроки - ТаблицаЗначений - колонки База, Реквизит.
Процедура ВыполнитьЗаполнение(ОтмеченныеСтроки) Экспорт

	Если ОтмеченныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ИндексИсточника = Новый Соответствие;
	Для Каждого СтрокаИсточника Из ОписаниеЗаполнения() Цикл
		ИндексИсточника.Вставить(
			КлючЗначения(СтрокаИсточника.База, СтрокаИсточника.Реквизит),
			СтрокаИсточника.НовоеЗначение);
	КонецЦикла;

	ЗначенияПоБазам = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из ОтмеченныеСтроки Цикл
		НовоеЗначение = ИндексИсточника.Получить(КлючЗначения(СтрокаТаблицы.База, СтрокаТаблицы.Реквизит));
		Если НовоеЗначение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		РеквизитыБазы = ЗначенияПоБазам.Получить(СтрокаТаблицы.База);
		Если РеквизитыБазы = Неопределено Тогда
			РеквизитыБазы = Новый Структура;
			ЗначенияПоБазам.Вставить(СтрокаТаблицы.База, РеквизитыБазы);
		КонецЕсли;
		РеквизитыБазы.Вставить(СтрокаТаблицы.Реквизит, НовоеЗначение);
	КонецЦикла;

	НачатьТранзакцию();
	Попытка
		Для Каждого ЭлементБазы Из ЗначенияПоБазам Цикл
			БазаОбъект = ЭлементБазы.Ключ.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(БазаОбъект, ЭлементБазы.Значение);
			БазаОбъект.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеЗаполнения()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("База", Новый ОписаниеТипов("СправочникСсылка.ИнформационныеБазыПорта"));
	Таблица.Колонки.Добавить("Реквизит", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	Таблица.Колонки.Добавить("НовоеЗначение");
	Таблица.Колонки.Добавить("Источник", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));

	ДобавитьПараметрыWebСервиса(Таблица, ПараметрыWebСервисаEDS());
	ДобавитьПараметрыWebСервиса(Таблица, ПараметрыWebСервисаУПП());
	ДобавитьПараметрыWebСервиса(Таблица, ПараметрыWebСервисаУКТ());
	ДобавитьПараметрыWebСервиса(Таблица, ПараметрыWebСервисаВМКТ());
	ДобавитьПараметрыСкаут(Таблица);

	Возврат Таблица;

КонецФункции

Функция ПараметрыWebСервисаEDS()

	Параметры = Новый Структура;
	Параметры.Вставить("База", Справочники.ИнформационныеБазыПорта.EDS);
	Параметры.Вставить("АдресWSDL", Константы.EDSUrl.Получить());
	Параметры.Вставить("Логин", Константы.EDSЛогин.Получить());
	Параметры.Вставить("Пароль", Константы.EDSПароль.Получить());
	Параметры.Вставить("КодПроверки", Константы.EDSКодПроверки.Получить());
	Параметры.Вставить("ИмяСервиса", "Eds");
	Параметры.Вставить("ИмяТочки", "EdsSoap");
	Параметры.Вставить("Таймаут", 10);
	Параметры.Вставить("ПрефиксКонстант", "EDS");

	Возврат Параметры;

КонецФункции

Функция ПараметрыWebСервисаУПП()

	Параметры = Новый Структура;
	Параметры.Вставить("База", Справочники.ИнформационныеБазыПорта.УПП);
	Параметры.Вставить("АдресWSDL", Константы.УППUrl.Получить());
	Параметры.Вставить("Логин", Константы.УППЛогин.Получить());
	Параметры.Вставить("Пароль", Константы.УПППароль.Получить());
	Параметры.Вставить("КодПроверки", Константы.УППКодПроверки.Получить());
	Параметры.Вставить("ИмяСервиса", "fishport");
	Параметры.Вставить("ИмяТочки", "fishportSoap");
	Параметры.Вставить("Таймаут", 10);
	Параметры.Вставить("ПрефиксКонстант", "УПП");

	Возврат Параметры;

КонецФункции

Функция ПараметрыWebСервисаУКТ()

	Параметры = Новый Структура;
	Параметры.Вставить("База", Справочники.ИнформационныеБазыПорта.УКТ);
	Параметры.Вставить("АдресWSDL", Константы.УКТUrl.Получить());
	Параметры.Вставить("Логин", Константы.УКТЛогин.Получить());
	Параметры.Вставить("Пароль", Константы.УКТПароль.Получить());
	Параметры.Вставить("КодПроверки", Константы.УКТКодПроверки.Получить());
	Параметры.Вставить("ИмяСервиса", "cnt");
	Параметры.Вставить("ИмяТочки", "cntSoap");
	Параметры.Вставить("Таймаут", 10);
	Параметры.Вставить("ПрефиксКонстант", "УКТ");

	Возврат Параметры;

КонецФункции

Функция ПараметрыWebСервисаВМКТ()

	Параметры = Новый Структура;
	Параметры.Вставить("База", Справочники.ИнформационныеБазыПорта.ВМКТ);
	Параметры.Вставить("АдресWSDL", Константы.ВМКТUrl.Получить());
	Параметры.Вставить("Логин", Константы.ВМКТЛогин.Получить());
	Параметры.Вставить("Пароль", Константы.ВМКТПароль.Получить());
	Параметры.Вставить("КодПроверки", Константы.ВМКТКодПроверки.Получить());
	Параметры.Вставить("ИмяСервиса", "disp");
	Параметры.Вставить("ИмяТочки", "dispSoap");
	Параметры.Вставить("Таймаут", 5);
	Параметры.Вставить("ПрефиксКонстант", "ВМКТ");

	Возврат Параметры;

КонецФункции

Процедура ДобавитьПараметрыWebСервиса(Таблица, Параметры)

	База = Параметры.База;
	ПрефиксКонстант = Параметры.ПрефиксКонстант;
	ДобавитьСтрокуИсточника(Таблица, База, "АдресWSDL", Параметры.АдресWSDL, "Константа " + ПрефиксКонстант + "Url");
	ДобавитьСтрокуИсточника(Таблица, База, "ПользовательСервиса", Параметры.Логин, "Константа " + ПрефиксКонстант + "Логин");
	ДобавитьСтрокуИсточника(Таблица, База, "ПарольСервиса", Параметры.Пароль, "Константа " + ПрефиксКонстант + "Пароль");
	ДобавитьСтрокуИсточника(Таблица, База, "КодПроверки", Параметры.КодПроверки, "Константа " + ПрефиксКонстант + "КодПроверки");
	ДобавитьСтрокуИсточника(Таблица, База, "URIПространстваИмен", URIПространстваИменПоУмолчанию(), "Значение по умолчанию");
	ДобавитьСтрокуИсточника(Таблица, База, "ИмяСервиса", Параметры.ИмяСервиса, "Значение по умолчанию");
	ДобавитьСтрокуИсточника(Таблица, База, "ИмяТочкиПодключения", Параметры.ИмяТочки, "Значение по умолчанию");
	ДобавитьСтрокуИсточника(Таблица, База, "ТаймаутЗапроса", Параметры.Таймаут, "Значение по умолчанию");

КонецПроцедуры

Процедура ДобавитьПараметрыСкаут(Таблица)

	База = Справочники.ИнформационныеБазыПорта.Скаут;
	ДобавитьСтрокуИсточника(Таблица, База, "ПользовательСервиса", Константы.ЛогинСкаут.Получить(), "Константа ЛогинСкаут");
	ДобавитьСтрокуИсточника(Таблица, База, "ПарольСервиса", Константы.ПарольСкаут.Получить(), "Константа ПарольСкаут");
	ДобавитьСтрокуИсточника(Таблица, База, "Путь", "api.scout-gps.ru", "Значение по умолчанию");
	ДобавитьСтрокуИсточника(Таблица, База, "Порт", 443, "Значение по умолчанию");
	ДобавитьСтрокуИсточника(
		Таблица,
		База,
		"ИдентификаторКлиента",
		"8b1fd704-096e-42d6-9ba5-6d98980e7cd1",
		"Значение по умолчанию");
	ДобавитьСтрокуИсточника(Таблица, База, "ТаймаутЗапроса", 10, "Значение по умолчанию");
	ДобавитьСтрокуИсточника(Таблица, База, "ТаймаутЗапросаКарточки", 5, "Значение по умолчанию");

КонецПроцедуры

Процедура ДобавитьСтрокуИсточника(Таблица, База, Реквизит, НовоеЗначение, Источник)

	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.База = База;
	СтрокаТаблицы.Реквизит = Реквизит;
	СтрокаТаблицы.НовоеЗначение = НовоеЗначение;
	СтрокаТаблицы.Источник = Источник;

КонецПроцедуры

Функция URIПространстваИменПоУмолчанию()

	Возврат "http://fishport.ru";

КонецФункции

Функция ТекущиеЗначенияСправочника()

	Результат = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИнформационныеБазыПорта.Ссылка КАК База,
		|	ИнформационныеБазыПорта.АдресWSDL КАК АдресWSDL,
		|	ИнформационныеБазыПорта.ПользовательСервиса КАК ПользовательСервиса,
		|	ИнформационныеБазыПорта.ПарольСервиса КАК ПарольСервиса,
		|	ИнформационныеБазыПорта.URIПространстваИмен КАК URIПространстваИмен,
		|	ИнформационныеБазыПорта.ИмяСервиса КАК ИмяСервиса,
		|	ИнформационныеБазыПорта.ИмяТочкиПодключения КАК ИмяТочкиПодключения,
		|	ИнформационныеБазыПорта.КодПроверки КАК КодПроверки,
		|	ИнформационныеБазыПорта.Путь КАК Путь,
		|	ИнформационныеБазыПорта.Порт КАК Порт,
		|	ИнформационныеБазыПорта.ТаймаутЗапроса КАК ТаймаутЗапроса,
		|	ИнформационныеБазыПорта.ТаймаутЗапросаКарточки КАК ТаймаутЗапросаКарточки,
		|	ИнформационныеБазыПорта.ИдентификаторКлиента КАК ИдентификаторКлиента
		|ИЗ
		|	Справочник.ИнформационныеБазыПорта КАК ИнформационныеБазыПорта
		|ГДЕ
		|	ИнформационныеБазыПорта.Ссылка В (&Базы)";
	Запрос.УстановитьПараметр("Базы", ПредопределенныеБазы());

	ИменаРеквизитов = СтрРазделить(
		"АдресWSDL,ПользовательСервиса,ПарольСервиса,URIПространстваИмен,ИмяСервиса,ИмяТочкиПодключения,КодПроверки,Путь,Порт,ТаймаутЗапроса,ТаймаутЗапросаКарточки,ИдентификаторКлиента",
		",",
		Ложь);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Для Каждого ИмяРеквизита Из ИменаРеквизитов Цикл
			Результат.Вставить(КлючЗначения(Выборка.База, ИмяРеквизита), Выборка[ИмяРеквизита]);
		КонецЦикла;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПредопределенныеБазы()

	Базы = Новый Массив;
	Базы.Добавить(Справочники.ИнформационныеБазыПорта.EDS);
	Базы.Добавить(Справочники.ИнформационныеБазыПорта.УПП);
	Базы.Добавить(Справочники.ИнформационныеБазыПорта.УКТ);
	Базы.Добавить(Справочники.ИнформационныеБазыПорта.ВМКТ);
	Базы.Добавить(Справочники.ИнформационныеБазыПорта.Скаут);

	Возврат Базы;

КонецФункции

Функция НоваяТаблицаПредпросмотра()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Заполнять", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("База", Новый ОписаниеТипов("СправочникСсылка.ИнформационныеБазыПорта"));
	Таблица.Колонки.Добавить("Реквизит", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	Таблица.Колонки.Добавить("ТекущееЗначение", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(300)));
	Таблица.Колонки.Добавить("НовоеЗначение", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(300)));
	Таблица.Колонки.Добавить("Источник", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));

	Возврат Таблица;

КонецФункции

Функция ПредставлениеЗначения(Реквизит, Значение)

	Если Реквизит = "ПарольСервиса" Тогда
		Если ПустаяСтрока(Строка(Значение)) Тогда
			Возврат "пусто";
		КонецЕсли;
		Возврат "заполнено";
	КонецЕсли;

	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Возврат СокрЛП(Строка(Значение));

КонецФункции

Функция ЗначенияСовпадают(Реквизит, ТекущееЗначение, НовоеЗначение)

	Если Реквизит = "Порт" Или Реквизит = "ТаймаутЗапроса" Или Реквизит = "ТаймаутЗапросаКарточки" Тогда
		Возврат ЧислоИзЗначения(ТекущееЗначение) = ЧислоИзЗначения(НовоеЗначение);
	КонецЕсли;

	Возврат СокрЛП(Строка(ТекущееЗначение)) = СокрЛП(Строка(НовоеЗначение));

КонецФункции

Функция ЧислоИзЗначения(Значение)

	Если Значение = Неопределено Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Число(Значение);

КонецФункции

Функция КлючЗначения(База, Реквизит)

	Возврат Строка(База.УникальныйИдентификатор()) + "|" + Реквизит;

КонецФункции

#КонецОбласти

#КонецЕсли
